SOLUTION.md
```puml
sequenceDiagram
    actor User
    participant GCS as Google Cloud Storage
    participant CRF as Serverless Cloud Run Function
    participant DS as Datastore

    User ->> GCS: Upload files
    GCS ->> CRF: Trigger event
    CRF ->> GCS: Fetch file content
    CRF ->> CRF: Process file content and classify
    CRF ->> DS: Store results
    DS -->> User: Results available (via query)

```
